package ru.mail.nn.pasha.iostreamtasks;

import java.io.ObjectOutputStream;

public class Second {
    /* Запишите в файл объект, имеющий нестатические поля типов:
     * пару разных базовых типов, один массив базовых типов и строку String.
     * Размер массива и строки должны храниться в файле.
     * использовать только байтовый поток, сериализацию и т.п. использовать нельзя.
     */

    /* прочитайте объект из файла, выведите на экран объект до записи и
     * прочитанный из файла объект, использовать toString
     */

    /* дозапишите в файл таким образом еще два таких объекта, но с другими
     * значениями полей, прочитайте в массив, выведите его на экран пользуясь Arrays
     */

    /* Сделайте тоже самое но с помощью сериализации*/

}

